<!DOCTYPE html>
<html lang="ru">
<head>
	<meta charset="UTF-8">
	<title>Программирование на языке PHP</title>
</head>
<body>
	
	<h1>Отправка данных на сервер</h1>
	<h2>Безопасность данных, часть 2</h2>
	<hr>
	<h2>Загрузка файлов</h2>

	<?php
		$_ERROR = []; // массив ошибок

		// проверяем поле логин на валидность 


		// проверяем загрузку на наличие ошибок


		// если массив ошибок пуст, проверяем, относится ли файл к разрешенным для загрузки

		
		// если массив ошибок пуст, пытаемся переместить файл в директорию upload

	?>


</body>
</html>