<!DOCTYPE html>
<html lang="ru">
<head>
	<meta charset="UTF-8">
	<title>Программирование на языке PHP</title>
</head>
<body>
	
	<h1>Отправка данных на сервер</h1>
	<h2>Отправка данных в строке запроса</h2>
	
	<?php
		// инициализация массива
		$course = [
			[
				"Основы программирования", 
				["Введение в PHP", "Переменные", "Константы", "Типы данных", "Строки"]
			],		
			[
				"Функции",
				["Встроенные функции", "Пользовательские функции", "Область видимости переменных"]
			],
			[
				"Управляющие конструкции",
				["Условные операторы", "Циклы", "Конструкции"]
			]
		];

		// вывод данных из массива $course согласно переданных параметров
	?>
	

</body>
</html>